#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
data.terraform_remote_state.secrets: Reading...
yandex_iam_service_account.s3: Refreshing state... [id=ajejj9j6gednfq88sn4t]
yandex_vpc_network.infrastructure: Refreshing state... [id=enpr3kklvdb0sadb2rk7]
data.terraform_remote_state.secrets: Read complete after 1s
yandex_resourcemanager_folder_iam_member.s3: Refreshing state... [id=b1g0e14had2hltv69li5/storage.admin/serviceAccount:ajejj9j6gednfq88sn4t]
yandex_iam_service_account_static_access_key.s3-static-key: Refreshing state... [id=ajejf8mj4tbec9ctshoq]
yandex_storage_bucket.s3-bucket: Refreshing state... [id=avdeev-terraform-state-bucket]
yandex_vpc_subnet.default["infrastructure-test-ru-central1-c"]: Refreshing state... [id=b0c1ae5noo4l5c0dlpua]
yandex_vpc_subnet.default["infrastructure-test-ru-central1-a"]: Refreshing state... [id=e9bm1anhj4gh2584mp6p]
yandex_vpc_subnet.default["infrastructure-test-ru-central1-b"]: Refreshing state... [id=e2l7qcrrsamlkppldqia]
data.yandex_vpc_subnet.default: Reading...
data.yandex_vpc_subnet.default: Read complete after 1s [id=e9bm1anhj4gh2584mp6p]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # yandex_compute_instance.web will be created
  + resource "yandex_compute_instance" "web" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + name                      = "web"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v3"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd81hgrcv6lsnkremf32"
              + name        = (known after apply)
              + size        = (known after apply)
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = (known after apply)
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = "e9bm1anhj4gh2584mp6p"
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 20
          + cores         = 2
          + memory        = 1
        }

      + scheduling_policy {
          + preemptible = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @AvdeevArtem, Action: `pull_request`*